thesis/tutorial.org
#+TITLE: Skript für Tutorial
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LaTeX_CLASS_OPTIONS: [koma,DIV=1,BCOR=1mm]
#+OPTIONS: toc:nil
* Einführung
Dieses Videotutorial soll in das Thema Planung und vorallem in die
Planungssprache PDDL einführen. Planung ist eine der wichtigsten
Komponenten des Problemlösens. Ein Problem liegt dann vor, wenn der
Soll-Zustand nicht dem Ist-Zustand entspricht. Bei der Planung wird
eine Abfolge von Handlungsschritten, sogenannten Aktionen entworfen,
die vom Ist-Zustand zum Soll-Zustand führt. D.h. es wird ein Plan wird
erstellt, der das Problem löst. Ziel der künstlichen Intelligenz
Forschung ist es natürlich, dass die Planung von der künstlichen
Intelligenz ausgeführt wird. Damit dies erfolgen kann, ist eine
detaillierte Beschreibung der Umwelt und des Problems notwendig.
Ausserdem bedarf es eines Algorithmus, der aus diesen Beschreibungen
die nötigen Schritte herleiten kann, die zur Lösung des Problems
führen. Die drei Bestandteile der automatisierten Planung sind also:

#+CAPTION: Planung in der KI
#+ATTR_LATEX: :font \footnotesize
|   | <12>         | <25>                      | <25>                      | <25>                      |
| / |              | <                         |                           |                           |
|   | *Komponente* | *Domäne*                  | *Problem*                 | *Planer*                  |
|---+--------------+---------------------------+---------------------------+---------------------------|
|   | *Definition* | Beschreibung der Welt     | Beschreibung des Problems | Software, die aus der     |
|   |              | - Eigenschaften und Beziehungen von Objektypen | - Instanziierung der Welt | Beschreibung der Welt und |
|   |              | - Einschränkungen         |                           |                           |
|   |              | - mögliche Aktionen und ihre Konsequenzen           | - Soll-Zustand            | entwickelt                |
|   |              |                           | - Ist-Zustand             | des Problems einen Plan   |
|   |              |                           |                           |                           |
|   |              |                           |                           |                           |
|   |              |                           |                           |                           |


Die Domäne und das Problem müssen zunächst erstellt werden, bevor sie
dem Planer übergeben werden können. Dieses Modellieren wird heutzutage
noch hauptsächlich von menschlichen Experten vorgenommen. Daher bedarf
eines Formulierungsstandards, der durch Planungssprachen gewährleistet
wird. Analog zu Programmiersprachen haben diese eine Syntax, also
konkrete Regeln und Vorschriften zum Erstellen von Domänen und
Problemen. Eine dieser Planungssprachen ist die Planning Domain
Definition Language oder PDDL.

#+CAPTION: Planung in der KI
#+ATTR_LATEX: :font \footnotesize
|   | <12>         | <25>                      | <25>                      | <25>                      |
| / |              | <                         |                           |                           |
|   | *Komponente* | *Domäne*                  | *Problem*                 | *Planer*                  |
|---+--------------+---------------------------+---------------------------+---------------------------|
|   | *Definition* | Beschreibung der Welt     | Beschreibung des Problems | Software, die aus der     |
|   |              | - Struktur                | - Instanziierung der Welt | Beschreibung der Welt und |
|   |              | - Einschränkungen         | - Ist-Zustand             | des Problems einen Plan   |
|   |              | - mögliche Aktionen und   | - Soll-Zustand            | entwickelt                |
|   |              | ihre Konsequenzen         |                           |                           |
|   | *Umsetzung*  | Mit einer Planungssprache | Mit einer Planungssprache | Software                  |
|   |              | in einem Editor           | in einem Editor           |                           |
|   | *Ausführung* | Menschlicher Experte      | Menschlicher Experte      | KI                        |


Im Folgenden soll dir nun beigebracht werden wie man mit PDDL Domänen
aufbaut. Dies wird anhand von einem konkreten Beispiel geschehen und
nach jedem Schritt wird dir eine Verständnisfrage gestellt. Du kannst
das Tutorial jederzeit pausieren um Fragen zu stellen, nochmal über
etwas nachzudenken oder zurückspulen wenn du etwas nochmal anschauen
möchtest. Versuche vorallem die Konzepte zu verstehen, damit du später
selbst Domänen erstellen kannst. Es ist nicht von Bedeutung, dass du
die Programmgerüste oder programmspezifischen Begriffe auswendig
lernst, jedoch, dass du sie später verstehst, wenn du sie erneut
siehst.
* Beispiel
** Die Welt
Willkommen in unserer Welt. Unsere Welt besteht aus zwei Menschen:
Tyler und Marla und einem Roboter, der mit ihnen wohnt aber nichts zur
Sache tut. Tyler arbeitet und Marla studiert Psychologie. Tyler muss
also jeden Tag auf die Arbeit und Marla geht freiwillig jeden Tag zur
Uni. Tyler und Marla wohnen im selben Haus, das viele verschiedene
Räume hat. So gibt es zum Beispiel eine Küche, ein Bad, zwei
Schlafzimmer, ein Wohnzimmer und eine Garage. Außerdem haben sowohl
Tyler als auch Marla ein Auto, aber Marla hat zusätzlich noch ein
Fahrrad. Alle Fahrzeuge stehen in der Garage. Marlas Auto war sehr
günstig und der Motor springt immer an kalten Tagen nicht an. Heute
ist ein kalter Montag Morgen.

** Das Problem
Ist: Tyler und Marla sind zu Hause.
Soll: Tyler soll auf die Arbeit und Marla soll zur Uni.

** Aufbau einer Domäne
Wie können wir diese Welt jetzt in PDDL repräsentieren?
PDDL-Dateien beschreiben entweder eine Domäne oder ein Problem, aber immer nur maximal eines.
Jede Domäne in PDDL hat die folgende Form:

#+BEGIN_EXAMPLE

(define (domain name)
	(:requirements :requirement1
 			:requirement2...)
	(:types  subsubtype1 subsubtype2 – subtype1
subtype1 – type1
subtype2 – type2…
subsubtype1 subsubtype2 subtype1 subtype2 type1 type2 …  - object)
	(:predicates  (predicateName1 ?var1 – typeOfVar1)
(predicateName2 ?var2 – typeOfVar2 ?var3 – typeOfVar3) ...)
	(:action actionName1
:parameters (...)
:precondition (...)
:effect (...) )
(:action actionName2
:parameters (...)
:precondition (...)
:effect (...) )
... )
#+END_EXAMPLE
Das wollen wir nun absatzweise anschauen und aufbauen.

*** (define (domain ...))

#+BEGIN_EXAMPLE
(define (domain ...))
#+END_EXAMPLE

Wer schon in LISP oder abgeleiteten Programmiersprachen programmiert
hat, dem sollte die Klammerung vertraut vorkommen. Auch das
Schlüsselwort define, das eine PDDL-Datei einleitet, sollte aus LISP
bereits bekannt sein. Als nächstes wird eingeklammert was man
eigentlich in dieser Datei definieren möchte. Dazu muss man sich als
erstes entscheiden ob man eine Domäne oder ein Problem modellieren
will. Wir interessieren uns momentan nur für Domänen, weshalb das
erste Wort immer domain sein wird. Jetzt kann man einen Namen für die
Domäne festlegen. Dieser kann frei gewählt werden. Da die Hauptakteure
unserer Welt Tyler und Marla heißen, nennen wir unsere Domäne
fightclub. Bisher sieht unsere PDDL-Datei also so aus:

#+BEGIN_EXAMPLE
(define (domain fightclub)
#+END_EXAMPLE

*** Requirements
#+BEGIN_EXAMPLE
 (:requirements  :requirement1
:requirement2...)
#+END_EXAMPLE
Die requirements sind vergleichbar mit dem Preamble in LaTeX. Hier
werden Domäneneigentschaften festgelegt. Unsere Domänen haben nur ein
requirement, nämlich typing. Das heißt, dass es in unseren Welten
Typenhierarchien gibt. Alle weiteren möglichen requirements sollen uns
nicht interessieren. Die Domäne sieht also jetzt so aus:
#+BEGIN_EXAMPLE
(define (domain fightclub)
	(:requirements :typing)
#+END_EXAMPLE

