thesis/tutorial.tex
\subsubsection{Types}
\label{sec-2-3-3}
\begin{verbatim}
(:types  subsubtype1 subsubtype2 – subtype1
subtype1 – type1
subtype2 – type2…
type1 type2 …  - object)
\end{verbatim}

Hier wird es jetzt interessant. In diesem Absatz wird die Welt
typisiert, bzw. strukturiert. Alle Entitäten in Domänen sind immer vom
Typ Objekt. Innerhalb dieser Objektoberklasse gibt es dann
verschiedene Typen und Untertypen. Die Hierarchien werden im Absatz
types modelliert. Damit wir nichts vergessen, ist es sinnvoll uns
zunächst den Aufbau unserer Beispielwelt in Form eines Diagramms zu
veranschaulichen.

(UML Diagramm zeichnen)

Nun wollen wir das in PDDL umsetzen:

\begin{verbatim}
(:types man woman – human
	human robot – agent 
	car bike – vehicle
	office university home – building
	kitchen livingroom bedroom garage bathroom – room
	room – home 
	building  – location 
	agent vehicle location – object)
\end{verbatim}

Unsere domain sieht jetzt also so aus:

\begin{verbatim}
(define (domain fightclub)
	(:requirements :typing)
	(:types man woman – human
	human robot – agent 
	car bike – vehicle
	office university home – building
	kitchen livingroom bedroom garage bathroom – room
	room – home 
	building  – location 
	agent vehicle location – object)
\end{verbatim}

Zur Überprüfung ob du das verstanden hast, versuche nun bitte folgende
Hierarchie selbst umzusetzen. Male hierfür zunächst auch ein
UML-Diagramm.

In einer Firma gibt es verschiedene Hierarchieebenen. Ausschließlich
Agenten können bei einer Firma arbeiten. Agenten können entweder
Roboter oder Menschen sein. Während es bei den Menschen
Hierarchiestrukturen gibt, ist dies bei den Robotern nicht der Fall.
Roboter haben keine Chefs und sind auch nicht in Führungspositionen,
sie tun einfach das wofür sie programmiert wurden. Die
Firmenhierarchie ist wie folgt: an oberster Stelle ist der Vorstand.
Neben dem Vorstand gibt es noch den Aufsichtsrat, der ebenfalls nur
aus Menschen besteht. Dem Vorstand ist alles untergeordnet. Auf der
nächsten Ebene lässt sich die Firma nun in die drei Bereiche
Entwicklung, Fertigung und Verkauf einteilen. Diese sind jeweils
wieder in zwei Abteilungen unterteilt, außer der Verkauf, der nur aus
5 einzelnen Arbeitern besteht (einzelne Arbeiter müssen nicht
modelliert werden). Jede Abteilung besteht wiederum aus zwei kleineren
Gruppen.

Aber warum ist das wichtig? Warum reicht es nicht einfach alle Objekte
in der Welt zu benennen? Warum müssen sie auch noch typisiert werden?

Das soll alles mit dem nächsten Absatz klarer werden.
\subsubsection{Predicates}
\label{sec-2-3-4}
\begin{verbatim}
(:predicates  (predicateName1 ?var1 – typeOfVar1)
(predicateName2 ?var2 – typeOfVar2 ?var3 – typeOfVar3) ...)
\end{verbatim}

Um eine Welt zu modellieren, reicht es nicht einfach nur zu sagen, was
alles vorhanden ist, und in welcher Beziehung die Objekte zueinander
stehen. Nein, meistens können Objekte in verschiedenen Zuständen
existieren und diese Zustände können sich ändern. So sind manche
Menschen schizophren und andere nicht, manche Räume haben Außenwände
aus Glas und viele nicht, während einige Männer sich gerne prügeln,
kann man das nicht über Küchengeräte behaupten. Um solche Zustände und
Eigenschaften von Objekten repräsentieren zu können gibt es Prädikate.
Prädikate können entweder wahr oder falsch sein. Außerdem
unterscheidet man Prädikate nach ihrer Stelligkeit. Wir wollen uns
hier nur mit ein- und zwei-stelligen Prädikaten befassen. Ein Prädikat
ist einstellig, wenn es nur ein Parameter gibt. Die Eigenschaft
schizophren zu sein, kann durch ein einstelliges Prädikat modelliert
werden. Das Prädikat könnte heißen istSchizophren? und es hat nur
einen Parameter, nämlich ein Objekt vom Typen Human. In PDDL-Notation
sähe das dann so aus:

\begin{verbatim}
(istSchizophren? ?x – human)
\end{verbatim}

Wobei ?x den Parameter ersetzt und festgelegt werden muss von welchem
Typ dieser sein soll. Der momentane Ort einer Person hingegen, kann
durch ein zweistelliges Prädikat modelliert werden. Ein solches
Prädikat könnte heißen ort? und wäre durch zwei Parameter, nämlich ein
Objekt vom Typ Human und ein Objekt vom Typ Location, definiert. Das
würde in PDDL-Notation so aussehen:

\begin{verbatim}
(ort? ?x – human ?y – location)
\end{verbatim}

Analog wollen wir für unsere Beispielwelt folgende Prädikate
definieren:

\begin{enumerate}
\item Menschen können in Gebäuden und Räumen sein (Wo ist ein eine Person?)
\item Fahrzeuge müssen im selben Gebäude sein wie der Mensch der sie nutzen will (Ist ein Fahrzeug im selben Gebäude?)
\item Fahrzeuge müssen dem Menschen gehören der sie nutzen will (Gehört das Fahrzeug dem Mensch?)
\item Fahrzeuge können kaputt sein (Ist ein Fahrzeug gerade kaputt?)
\end{enumerate}

Versuche doch zunächst einmal selbst diese Prädikate in PDDL-Notation
aufzustellen.

\begin{verbatim}
(:predicates (at? ?person – human ?place – location)
(inSameBuilding? ?person – human ?veh – vehicle)
(belongsTo? ?veh – vehicle ?person – human)
(broken? ?veh – vehicle))
\end{verbatim}

Hier sieht man nun, dass es sinnvoll ist, Typen zu deklarieren, da
manche Prädikate auf Elemente von Oberklassen zutreffen können und
somit nicht alle Untertypen einzeln aufgeführt werden müssen.

Bisher sieht unsere Domäne so aus:

\begin{verbatim}
(define (domain fightclub)
	(:requirements :typing)
	(:types man woman – human
	human robot – agent 
	car bike – vehicle
	office university home – building
	kitchen livingroom bedroom garage bathroom – room
	room – home 
	building  – location 
	agent vehicle location – object)
	(:predicates (at? ?person – human ?place – location)
(inSameBuilding? ?person – human ?veh – vehicle)
(belongsTo? ?veh – vehicle ?person – human)
(broken? ?veh – vehicle))
\end{verbatim}
