thesis/tutorial.tex

\subsubsection{Aktionen}
\label{sec-2-3-5}

\begin{verbatim}
(:action actionName2
:parameters (...)
:precondition (...)
:effect (...) )
... )
\end{verbatim}

Zu guter Letzt wollen wir uns nun den Aktionen widmen. Aktionen sind
wichtig, da durch Aktionen die Zustände und Eigenschaften von Objekten
derart verändert werden können, dass Probleme gelöst werden können.
Aktionen bestehen immer aus drei Teilen: Parametern, Vorbedingungen
und Wirkungen. Nehmen wir an, man könnte schlau werden durch lesen
bestimmter Inhalte. Damit hätten wir eine sehr einfache Aktion lesen.
Diese hätte zwei Parameter, nämlich die Person, die liest und die
Inhalte, die sie liest. Als Vorbedingung muss gelten, dass die Person
lesen kann, dass die Person nicht bereits schlau ist und dass die
Inhalte bilden (alles drei Prädikate, die bereits im Absatz predicates
auftauchen sollten). Der Effekt soll schließlich sein, dass die Person
schlau ist.

\begin{verbatim}
(:action read
         	:parameters 	(?p - person ?con - contents)
         	:precondition	(and (literate? ?p)
                             		(not (smart? ?p))
                            			(educating? ?con))
         	:effect 		(smart? ?p))
\end{verbatim}

Versuche nun einmal die Aktion drive für unsere Beispielwelt
aufzustellen, bei der eine Person ihren Ort ändert mittels eines
Fahrzeugs, das nicht kaputt sein darf, der Person gehören muss und im
selben Gebäude wie die Person zu Beginn sein muss.

\begin{verbatim}
(:action drive
        :parameters (?p - person ?v – vehicle ?to ?from – location)
        :precondition (and (at? ?p ?from)
                           (inSameBuilding? ?p ?v)
                           (belongsTo? ?v ?p)                                      
                           (not (broken? ?v)))
        :effect                 (at? ?p ?to))
\end{verbatim}

Herzlichen Glückwunsch! Wir haben gemeinsam eine Domäne erstellt.
Diese sieht jetzt so aus:

\begin{verbatim}
(define (domain fightclub)

  (:requirements :typing)

  (:types man woman – human
        human robot – agent 
        car bike – vehicle
        office university home – building
        kitchen livingroom bedroom garage bathroom – room
        room – home 
        building  – location 
        agent vehicle location – object)

  (:predicates (at? ?person – human ?place – location)
                (inSameBuilding? ?person – human ?veh – vehicle)
                (belongsTo? ?veh – vehicle ?person – human)
                (broken? ?veh – vehicle))

 (:action drive
     :parameters (?p - person ?v – vehicle ?to ?from – location)
     :precondition (and (at? ?p ?from)
                        (inSameBuilding? ?p ?v)
                        (belongsTo? ?v ?p)                                      
                        (not (broken? ?v)))
     :effect            (at? ?p ?to)))
\end{verbatim}

Hiermit hast du das Videotutorial geschafft. Keine Sorge, schwieriger
wird es nicht mehr! Solltest du noch Fragen haben, oder falls
irgendetwas noch unklar ist bzw. nicht ausreichend erklärt wurde,
wende dich bitte an den Versuchsleiter. Für den Rest des Versuchs ist
es wirklich wichtig, dass keine Fragen mehr offen sind!
% Emacs 24.3.1 (Org mode 8.2.5h)
\end{document}